### CRUD stands for Create, Read, Update, and Delete. 

### These are the basic operations that can be performed on data in a database, and they form the foundation of database management.

<br>

## Create 
- ## INSERT INTO db.table_name (columns) VALUES (values)
    - ## Insert specfic value
    - ## Change Order
    - ## Insert value without define columns
    - ## Insert Multiple Values

<hr>
<br>

## Read
- ## Working on csv Data Set
- ## SELECT * FROM database.tablename WHERE 1
- ## Working With %sql on dataset
  - ## Select all
  - ## Select Specfic Columns
  - ## Rename Column --> Alias As Keyword
  - ## Apply mathematical operations
  - ## Create New Column and Add Specfic Values in All columns
  - ## DISTINCT  (Extract Unique Values)
  - ## DISTINCT for Multiple columns combination
  - ## Filter with Rows With WHERE
  - ## BETWEEN (use for Filter ROws on Multiple conditions)
  - ## Filter Multiple Condition Without BETWEEN
  - ## IN  (use codition with specfic values)
  - ## NOT IN (Alternative of IN)
 
<hr>
<br>

## UPDATE
- ## UPDATE (change the columns values)
    - ## UPDATE database.table SET column='new_value' Where column='old_value'
    - ## UPDATE  Based on Multiple value

<hr>
<br>

## DELETE
- ## DELETE (delete values on specfic condition)
- ## DELETE FROM database.table WHERE column = "value"
- ## DELETE  Based on Multiple value

In [258]:
import mysql.connector

db = mysql.connector.connect(host="localhost",user="root",password="")

In [259]:
db.connect()
cursor = db.cursor()

cursor.execute('USE login')

<br>

## Show Columns

In [260]:
cursor.execute("SHOW COLUMNS FROM users")
columns = cursor.fetchall()

for col in columns:
    print(col[0],col[1])

username varchar(255)
name varchar(255)

## SHOW Values

In [263]:
query = """
        SELECT * FROM users
"""
cursor.execute(query)

values = cursor.fetchall()

for val in values:
    print(val)
    
print(values)

[]

<br>

# Insert Values

In [264]:
query = """
        INSERT INTO login.users (username,name) # Define Columns 
        VALUES ('alix66','Ali')                 # Define Values
"""
cursor.execute(query)

In [265]:
query = """
        SELECT * FROM users
"""
cursor.execute(query)

values = cursor.fetchall()

for val in values:
    print(val)

('alix66', 'Ali')

<br>

## Insert only specfic Values

In [266]:
query = """
        INSERT INTO login.users (username)
        
        VALUES ("Zain@667")
"""
cursor.execute(query)

In [267]:
query = """
        SELECT * FROM users
"""
cursor.execute(query)

values = cursor.fetchall()

for val in values:
    print(val)

('alix66', 'Ali')
('Zain@667', None)

<br>

## Change the order

In [268]:
query = """
        INSERT INTO login.users (name,username)
        
        VALUES ("Zain@667","Zain")
"""
cursor.execute(query)

In [269]:
query = """
        SELECT * FROM users
"""
cursor.execute(query)

values = cursor.fetchall()

for val in values:
    print(val)

a

('alix66', 'Ali')
('Zain@667', None)
('Zain', 'Zain@667')

## What if we not define columns ?

In [270]:
query = """
        INSERT INTO login.users VALUES ("order1","order2")
"""

cursor.execute(query)

In [271]:
query = """
        SELECT * FROM users
"""
cursor.execute(query)

values = cursor.fetchall()

for val in values:
    print(val)

('alix66', 'Ali')
('Zain@667', None)
('Zain', 'Zain@667')
('order1', 'order2')

###  if we not define the columns than values filled with Default Order

In [272]:
query = """
        INSERT INTO login.users VALUES
        
        ("1","1"),
        ("2","2"),
        ("3","3"),
        ("4","4")
"""
cursor.execute(query)

In [273]:
query = """
        SELECT * FROM users
"""
cursor.execute(query)

values = cursor.fetchall()

for val in values:
    print(val)

('alix66', 'Ali')
('Zain@667', None)
('Zain', 'Zain@667')
('order1', 'order2')
('1', '1')
('2', '2')
('3', '3')
('4', '4')

<br><br>

# Read 
### Select Dataset

<br><br>

In [274]:
cursor.execute("SHOW DATABASES")

for i in cursor:
    print(i)

('DDL',)
('campusx',)
('csv_data',)
('information_schema',)
('login',)
('mydatabase',)
('mydb',)
('mysql',)
('performance_schema',)
('phpmyadmin',)
('test',)
('testing',)
('wasa',)

In [275]:
cursor.execute("USE csv_data")

In [276]:
cursor.execute("SHOW TABLES")

for i in cursor:
    print(i)

('mobile',)

# Read data

In [277]:
db.connect()
cursor = db.cursor()

In [278]:
cursor.execute("SELECT * FROM csv_data.mobile WHERE 1")
for i in cursor:
    print(i)
    break

('oneplus', 'OnePlus Nord CE 2 Lite 5G', 19989, Decimal('81.0'), 'True', 'False', 'False', 'snapdragon', Decimal('8.0'), Decimal('2.20'), Decimal('5000.0'), 1, Decimal('33.0'), Decimal('6.0'), Decimal('128.0'), Decimal('6.59'), 120, 3, Decimal('1.0'), 'android', Decimal('64.0'), Decimal('16.0'), 1, Decimal('1024.0'), 1080, 2412)

<br>

### For Better visualization i use ipython-sql

- ### !pip install ipython-sql

In [1]:
%load_ext sql
%sql mysql+pymysql://root:@localhost/csv_data

# load data in database  mysql_pymysql:// user :@ip: port (optional) / database name

## now use %sql With any query

In [2]:
res = %sql SELECT * FROM csv_data.mobile WHERE 1

res.DataFrame().sample(3)

 * mysql+pymysql://root:***@localhost/csv_data
352 rows affected.

,brand_name,model,price,rating,has_5g,has_nfc,has_ir_blaster,processor_brand,num_cores,processor_speed,...,refresh_rate,num_rear_cameras,num_front_cameras,os,primary_camera_rear,primary_camera_front,extended_memory_available,extended_upto,resolution_width,resolution_height
310,realme,Realme 6 (6GB RAM + 64GB),12989,77.0,False,False,False,helio,8.0,2.05,...,90,4,1.0,android,64.0,16.0,1,256.0,1080,2400
232,xiaomi,Xiaomi Redmi Note 10 5G,12490,76.0,True,False,True,dimensity,8.0,2.20,...,90,3,1.0,android,48.0,8.0,1,512.0,1080,2400
158,samsung,Samsung Galaxy A04s,12990,71.0,False,False,False,exynos,8.0,2.00,...,90,3,1.0,android,50.0,5.0,1,1024.0,720,1600

### Here i load data into result variable then convert into DataFrame

<br>
<br>

 - # Select all

In [6]:
reselt = %sql SELECT * FROM csv_data.mobile WHERE 1

reselt.DataFrame().sample(5)

 * mysql+pymysql://root:***@localhost/csv_data
352 rows affected.

,brand_name,model,price,rating,has_5g,has_nfc,has_ir_blaster,processor_brand,num_cores,processor_speed,...,refresh_rate,num_rear_cameras,num_front_cameras,os,primary_camera_rear,primary_camera_front,extended_memory_available,extended_upto,resolution_width,resolution_height
344,samsung,Samsung Galaxy F12,10499,73.0,False,False,False,exynos,8.0,2.00,...,90,4,1.0,android,48.0,8.0,1,512.0,720,1600
26,motorola,Motorola Moto G32,10499,75.0,False,False,False,snapdragon,8.0,2.40,...,90,3,1.0,android,50.0,16.0,1,1024.0,1080,2400
295,realme,Realme Narzo 30 5G,16999,80.0,True,True,False,dimensity,8.0,2.20,...,90,3,1.0,android,48.0,16.0,1,1024.0,1080,2400
178,samsung,Samsung Galaxy A32,16499,80.0,False,False,False,helio,8.0,2.00,...,90,4,1.0,android,64.0,20.0,1,1024.0,1080,2400
183,samsung,Samsung Galaxy M04 (4GB RAM + 128GB),9499,68.0,False,False,False,helio,8.0,2.30,...,60,2,1.0,android,13.0,5.0,1,1024.0,720,1600

- ### Select use for Selection
- ### * means ALl
- ### FROM use for select in database. in table
- ### WHERE 1 on is the optional

<br>

##  Query Without Where 1

In [7]:
reselt = %sql SELECT * FROM csv_data.mobile

reselt.DataFrame().sample(5)

 * mysql+pymysql://root:***@localhost/csv_data
352 rows affected.

,brand_name,model,price,rating,has_5g,has_nfc,has_ir_blaster,processor_brand,num_cores,processor_speed,...,refresh_rate,num_rear_cameras,num_front_cameras,os,primary_camera_rear,primary_camera_front,extended_memory_available,extended_upto,resolution_width,resolution_height
4,vivo,Vivo T1 5G (6GB RAM + 128GB),16990,80.0,True,False,False,snapdragon,8.0,2.20,...,120,3,1.0,android,50.0,16.0,1,1024.0,1080,2408
111,oppo,OPPO A1 Pro,20990,84.0,True,True,False,snapdragon,8.0,2.20,...,120,2,1.0,android,108.0,16.0,1,1024.0,1080,2412
8,oneplus,OnePlus Nord CE 2 Lite 5G (8GB RAM + 128GB),21995,84.0,True,False,False,snapdragon,8.0,2.20,...,120,3,1.0,android,64.0,16.0,1,1024.0,1080,2412
221,motorola,Motorola Moto E32s,7990,65.0,False,False,False,helio,8.0,1.80,...,90,3,1.0,android,16.0,8.0,1,1024.0,720,1600
308,xiaomi,Xiaomi Mi 11 Lite (8GB RAM + 128GB),18699,82.0,False,False,True,snapdragon,8.0,2.30,...,90,3,1.0,android,64.0,16.0,1,512.0,1080,2400

<br>

## Select Specfic Columns

In [8]:
reselt = %sql SELECT model,price,rating FROM csv_data.mobile

reselt.DataFrame().sample(5)

 * mysql+pymysql://root:***@localhost/csv_data
352 rows affected.

                                       model  price rating
37                     Samsung Galaxy M13 5G  13999   75.0
224                         Realme Narzo 50A  11499   71.0
176  Xiaomi Redmi Note 11S (8GB RAM + 128GB)  15824   84.0
87                     Samsung Galaxy M54 5G  34999   85.0
251      Realme Narzo 50 5G (4GB RAM + 64GB)  13499   75.0

<br>

## Rename Columns

In [12]:
reselt = %sql SELECT os,battery_capacity FROM csv_data.mobile

reselt.DataFrame().sample(5)

 * mysql+pymysql://root:***@localhost/csv_data
352 rows affected.

          os battery_capacity
334  android           4500.0
248  android           5000.0
301  android           5000.0
65   android           5000.0
37   android           5000.0

In [40]:
result = %sql SELECT os AS "OS" ,battery_capacity AS "mAh" FROM csv_data.mobile

result.DataFrame().sample(6)

 * mysql+pymysql://root:***@localhost/csv_data
352 rows affected.

          OS     mAh
172  android  5000.0
248  android  5000.0
80   android  5000.0
178  android  5000.0
227  android  4500.0
9    android  4500.0

## Apply mathematical operations

In [66]:
result = %sql SELECT model,resolution_width,resolution_height,screen_size FROM csv_data.mobile
result.DataFrame().sample(6)

 * mysql+pymysql://root:***@localhost/csv_data
352 rows affected.

,model,resolution_width,resolution_height,screen_size
207,iQOO Z6 4G,1080,2400,6.44
105,Vivo T1 Pro 5G (8GB RAM + 128GB),1080,2404,6.44
115,Samsung Galaxy A53 (8GB RAM + 256GB),1080,2400,6.50
217,Realme 8s 5G,1080,2400,6.50
326,Poco X4,1080,2400,6.67
143,Xiaomi Redmi Note 11S,1080,2400,6.43

## Now Extract PPI Diagonal
- ### square root of  width*2  + hight *2

In [64]:
result = %sql SELECT model, resolution_width * resolution_width + resolution_height*resolution_height FROM  csv_data.mobile
result.DataFrame().head(6)

 * mysql+pymysql://root:***@localhost/csv_data
352 rows affected.

,model,resolution_width * resolution_width + resolution_height*resolution_height
0,OnePlus Nord CE 2 Lite 5G,6984144
1,Samsung Galaxy A14 5G,6964864
2,Samsung Galaxy F23 5G (6GB RAM + 128GB),6964864
3,Realme 10 Pro,6926400
4,Vivo T1 5G (6GB RAM + 128GB),6964864
5,Vivo Y22,3116944

- ### Now I alse use bulit in Functions SQRT()

In [67]:
result = %sql SELECT model, SQRT(resolution_width * resolution_width + resolution_height*resolution_height) / screen_size  FROM  csv_data.mobile
result.DataFrame().head(6)

 * mysql+pymysql://root:***@localhost/csv_data
352 rows affected.

,model,SQRT(resolution_width * resolution_width + resolution_height*resolution_height) / screen_size
0,OnePlus Nord CE 2 Lite 5G,401.024751
1,Samsung Galaxy A14 5G,399.864072
2,Samsung Galaxy F23 5G (6GB RAM + 128GB),399.864072
3,Realme 10 Pro,391.637718
4,Vivo T1 5G (6GB RAM + 128GB),401.079465
5,Vivo Y22,269.539985

## also use Alias

In [96]:
result = %sql SELECT model, SQRT(resolution_width * resolution_width + resolution_height*resolution_height) / screen_size AS "PPI"  FROM  csv_data.mobile
result.DataFrame().head(6)

 * mysql+pymysql://root:***@localhost/csv_data
352 rows affected.

                                     model         PPI
0                OnePlus Nord CE 2 Lite 5G  401.024751
1                    Samsung Galaxy A14 5G  399.864072
2  Samsung Galaxy F23 5G (6GB RAM + 128GB)  399.864072
3                            Realme 10 Pro  391.637718
4             Vivo T1 5G (6GB RAM + 128GB)  401.079465
5                                 Vivo Y22  269.539985

## Example 2

In [88]:
result = %sql SELECT model,rating FROM  csv_data.mobile
result.DataFrame().head(6)

 * mysql+pymysql://root:***@localhost/csv_data
352 rows affected.

                                     model rating
0                OnePlus Nord CE 2 Lite 5G   81.0
1                    Samsung Galaxy A14 5G   75.0
2  Samsung Galaxy F23 5G (6GB RAM + 128GB)   80.0
3                            Realme 10 Pro   82.0
4             Vivo T1 5G (6GB RAM + 128GB)   80.0
5                                 Vivo Y22   72.0

### Convert rating into 100 Scale

In [92]:
result = %sql SELECT model,rating / 10 FROM  csv_data.mobile
result.DataFrame().head(6)

 * mysql+pymysql://root:***@localhost/csv_data
352 rows affected.

                                     model rating / 10
0                OnePlus Nord CE 2 Lite 5G     8.10000
1                    Samsung Galaxy A14 5G     7.50000
2  Samsung Galaxy F23 5G (6GB RAM + 128GB)     8.00000
3                            Realme 10 Pro     8.20000
4             Vivo T1 5G (6GB RAM + 128GB)     8.00000
5                                 Vivo Y22     7.20000

## Create New Column and add Specfic Value

In [103]:
result = %sql SELECT model, "SmartPhones" AS "Item Type" FROM  csv_data.mobile
result.DataFrame().head(6)

 * mysql+pymysql://root:***@localhost/csv_data
352 rows affected.

                                     model    Item Type
0                OnePlus Nord CE 2 Lite 5G  SmartPhones
1                    Samsung Galaxy A14 5G  SmartPhones
2  Samsung Galaxy F23 5G (6GB RAM + 128GB)  SmartPhones
3                            Realme 10 Pro  SmartPhones
4             Vivo T1 5G (6GB RAM + 128GB)  SmartPhones
5                                 Vivo Y22  SmartPhones

## DISTINCT for Extract Unique Value

In [118]:
result = %sql SELECT DISTINCT(model) AS "Unique Models" FROM  csv_data.mobile

result.DataFrame()

 * mysql+pymysql://root:***@localhost/csv_data
352 rows affected.

                               Unique Models
0                  OnePlus Nord CE 2 Lite 5G
1                      Samsung Galaxy A14 5G
2    Samsung Galaxy F23 5G (6GB RAM + 128GB)
3                              Realme 10 Pro
4               Vivo T1 5G (6GB RAM + 128GB)
..                                       ...
347                          Realme Narzo 20
348                                OPPO A58x
349                               Doogee S99
350  Realme Narzo 50i Prime (4GB RAM + 64GB)
351                              Honor X8 5G

[352 rows x 1 columns]

## use Disinct With Multiples Columns combination

In [123]:
result = %sql SELECT brand_name,processor_brand  FROM  csv_data.mobile

result.DataFrame().head(10)

 * mysql+pymysql://root:***@localhost/csv_data
352 rows affected.

  brand_name processor_brand
0    oneplus      snapdragon
1    samsung          exynos
2    samsung      snapdragon
3     realme      snapdragon
4       vivo      snapdragon
5       vivo           helio
6       poco      snapdragon
7     xiaomi      snapdragon
8    oneplus      snapdragon
9       vivo       dimensity

In [127]:
result = %sql SELECT  DISTINCT brand_name,processor_brand  FROM  csv_data.mobile
result.DataFrame().head(10)

 * mysql+pymysql://root:***@localhost/csv_data
46 rows affected.

  brand_name processor_brand
0    oneplus      snapdragon
1    samsung          exynos
2    samsung      snapdragon
3     realme      snapdragon
4       vivo      snapdragon
5       vivo           helio
6       poco      snapdragon
7     xiaomi      snapdragon
8       vivo       dimensity
9    samsung       dimensity

## Filter Rows with WHERE

In [129]:
result = %sql SELECT  * FROM  csv_data.mobile WHERE brand_name = 'xiaomi'

result.DataFrame().head(6)

 * mysql+pymysql://root:***@localhost/csv_data
66 rows affected.

,brand_name,model,price,rating,has_5g,has_nfc,has_ir_blaster,processor_brand,num_cores,processor_speed,...,refresh_rate,num_rear_cameras,num_front_cameras,os,primary_camera_rear,primary_camera_front,extended_memory_available,extended_upto,resolution_width,resolution_height
0,xiaomi,Xiaomi Redmi Note 12,17859,76.0,True,False,True,snapdragon,8.0,2.00,...,120,3,1.0,android,48.0,13.0,1,1024.0,1080,2400
1,xiaomi,Xiaomi Redmi Note 12 Pro Max 5G,32999,83.0,True,False,True,snapdragon,8.0,2.36,...,120,4,1.0,android,108.0,32.0,1,512.0,1080,2460
2,xiaomi,Xiaomi Redmi Note 11 Pro Plus 5G,19999,83.0,True,False,True,snapdragon,8.0,2.20,...,120,3,1.0,android,108.0,16.0,1,1024.0,1080,2400
3,xiaomi,Xiaomi Redmi Note 11,11936,76.0,False,False,True,snapdragon,8.0,2.40,...,90,4,1.0,android,50.0,13.0,1,512.0,1080,2400
4,xiaomi,Xiaomi Redmi Note 10S,10999,78.0,False,False,True,helio,8.0,2.05,...,60,4,1.0,android,64.0,13.0,1,512.0,1080,2400
5,xiaomi,Xiaomi Redmi Note 10T 5G (6GB RAM +128GB),13999,79.0,True,False,True,dimensity,8.0,2.20,...,90,3,1.0,android,48.0,8.0,1,1024.0,1080,2400

# Example 2 find phones > 50000 price

In [131]:
result = %sql SELECT  * FROM  csv_data.mobile WHERE price > 50000

result.DataFrame().head(6)

 * mysql+pymysql://root:***@localhost/csv_data
5 rows affected.

,brand_name,model,price,rating,has_5g,has_nfc,has_ir_blaster,processor_brand,num_cores,processor_speed,...,refresh_rate,num_rear_cameras,num_front_cameras,os,primary_camera_rear,primary_camera_front,extended_memory_available,extended_upto,resolution_width,resolution_height
0,huawei,Huawei Mate 50 RS Porsche Design,239999,81.0,False,True,True,snapdragon,8.0,3.20,...,120,3,1.0,other,50.0,13.0,1,256.0,1212,2616
1,samsung,Samsung Galaxy Note 10 Plus,58999,89.0,False,True,False,exynos,8.0,2.73,...,60,4,1.0,android,12.0,10.0,1,1024.0,1440,3040
2,samsung,Samsung Galaxy S20 5G,74999,89.0,True,True,False,exynos,8.0,2.73,...,60,3,1.0,android,64.0,10.0,1,1024.0,1440,3200
3,samsung,Samsung Galaxy S20 Plus,83000,88.0,False,True,False,exynos,8.0,2.73,...,120,4,1.0,android,64.0,10.0,1,1024.0,1440,3200
4,samsung,Samsung Galaxy S10 5G,78990,86.0,True,True,False,exynos,8.0,2.70,...,60,3,1.0,android,16.0,10.0,1,512.0,1440,3040

# BETWEEN  Filter or Multiple conditions

In [137]:
result = %sql SELECT  * FROM  csv_data.mobile WHERE price BETWEEN 40000 AND 50000

result.DataFrame()

 * mysql+pymysql://root:***@localhost/csv_data
4 rows affected.

,brand_name,model,price,rating,has_5g,has_nfc,has_ir_blaster,processor_brand,num_cores,processor_speed,...,refresh_rate,num_rear_cameras,num_front_cameras,os,primary_camera_rear,primary_camera_front,extended_memory_available,extended_upto,resolution_width,resolution_height
0,samsung,Samsung Galaxy S10 Plus,42999,81.0,False,True,False,exynos,8.0,2.70,...,60,3,2.0,android,16.0,10.0,1,512.0,1440,3040
1,samsung,Samsung Galaxy S20,41999,88.0,False,True,False,exynos,8.0,2.73,...,120,3,1.0,android,64.0,10.0,1,1024.0,1440,3200
2,doogee,Doogee V Max,45999,88.0,True,False,False,dimensity,8.0,2.60,...,120,3,1.0,android,108.0,32.0,1,2048.0,1080,2408
3,nokia,Nokia X30,41990,85.0,True,True,False,snapdragon,8.0,2.20,...,90,2,1.0,android,50.0,16.0,1,1024.0,1080,2400

## Do Same thing without Between

In [139]:
result = %sql SELECT  * FROM  csv_data.mobile WHERE price >= 40000 AND  price <= 50000

result.DataFrame()

 * mysql+pymysql://root:***@localhost/csv_data
4 rows affected.

,brand_name,model,price,rating,has_5g,has_nfc,has_ir_blaster,processor_brand,num_cores,processor_speed,...,refresh_rate,num_rear_cameras,num_front_cameras,os,primary_camera_rear,primary_camera_front,extended_memory_available,extended_upto,resolution_width,resolution_height
0,samsung,Samsung Galaxy S10 Plus,42999,81.0,False,True,False,exynos,8.0,2.70,...,60,3,2.0,android,16.0,10.0,1,512.0,1440,3040
1,samsung,Samsung Galaxy S20,41999,88.0,False,True,False,exynos,8.0,2.73,...,120,3,1.0,android,64.0,10.0,1,1024.0,1440,3200
2,doogee,Doogee V Max,45999,88.0,True,False,False,dimensity,8.0,2.60,...,120,3,1.0,android,108.0,32.0,1,2048.0,1080,2408
3,nokia,Nokia X30,41990,85.0,True,True,False,snapdragon,8.0,2.20,...,90,2,1.0,android,50.0,16.0,1,1024.0,1080,2400

# IN Extract only specfic multiples values

In [145]:
result = %sql SELECT  DISTINCT(brand_name) FROM  csv_data.mobile
result.DataFrame()

 * mysql+pymysql://root:***@localhost/csv_data
21 rows affected.

   brand_name
0     oneplus
1     samsung
2      realme
3        vivo
4        poco
5      xiaomi
6        oppo
7    motorola
8         jio
9        iqoo
10    infinix
11       cola
12      tecno
13      redmi
14      nokia
15     huawei
16       sony
17       lava
18       itel
19     doogee
20      honor

## NOw Extract only samsung,redmi,poco data

#### First apply condition with OR

In [149]:
result = %sql SELECT  brand_name FROM  csv_data.mobile WHERE brand_name = "samsung" OR brand_name = "redmi" OR brand_name = "poco"
result.DataFrame()

 * mysql+pymysql://root:***@localhost/csv_data
89 rows affected.

   brand_name
0     samsung
1     samsung
2        poco
3     samsung
4     samsung
..        ...
84    samsung
85    samsung
86    samsung
87    samsung
88    samsung

[89 rows x 1 columns]

### Now Same thing with IN

In [150]:
result = %sql SELECT  brand_name FROM  csv_data.mobile WHERE brand_name IN("samsung","redmi","poco")
result.DataFrame()

 * mysql+pymysql://root:***@localhost/csv_data
89 rows affected.

   brand_name
0     samsung
1     samsung
2        poco
3     samsung
4     samsung
..        ...
84    samsung
85    samsung
86    samsung
87    samsung
88    samsung

[89 rows x 1 columns]

# NOT IN
- ### Alternative on IN

## Extract Values that are not onlsamsung,redmi,poco in brand_name

In [151]:
result = %sql SELECT  brand_name FROM  csv_data.mobile WHERE brand_name NOT IN("samsung","redmi","poco")
result.DataFrame()

 * mysql+pymysql://root:***@localhost/csv_data
263 rows affected.

    brand_name
0      oneplus
1       realme
2         vivo
3         vivo
4       xiaomi
..         ...
258     realme
259       oppo
260     doogee
261     realme
262      honor

[263 rows x 1 columns]

<br>

# UPDATE

In [157]:
result = %sql SELECT brand_name,os,processor_brand  FROM csv_data.mobile
result.DataFrame().head()

 * mysql+pymysql://root:***@localhost/csv_data
352 rows affected.

  brand_name       os processor_brand
0    oneplus  android      snapdragon
1    samsung  android          exynos
2    samsung  android      snapdragon
3     realme  android      snapdragon
4       vivo  android      snapdragon

### now Change All snapdragon with openSource

In [158]:
%sql UPDATE csv_data.mobile SET processor_brand='openSource' Where processor_brand='snapdragon'

 * mysql+pymysql://root:***@localhost/csv_data
136 rows affected.

Empty DataFrame
Columns: []
Index: []

## Now Check value

In [159]:
result = %sql SELECT brand_name,os,processor_brand  FROM csv_data.mobile
result.DataFrame().head()

 * mysql+pymysql://root:***@localhost/csv_data
352 rows affected.

  brand_name       os processor_brand
0    oneplus  android      openSource
1    samsung  android          exynos
2    samsung  android      openSource
3     realme  android      openSource
4       vivo  android      openSource

### Update value on multiple Conditions

In [166]:
%sql UPDATE csv_data.mobile SET brand_name='key', processor_brand='value' Where os = 'android'

 * mysql+pymysql://root:***@localhost/csv_data
351 rows affected.

[]

In [168]:
result = %sql SELECT DISTINCT brand_name,processor_brand FROM csv_data.mobile
result.DataFrame().head()

 * mysql+pymysql://root:***@localhost/csv_data
2 rows affected.

  brand_name processor_brand
0        key           value
1     huawei           value

In [169]:
result = %sql SELECT DISTINCT brand_name,processor_brand FROM csv_data.mobile
reselt

 * mysql+pymysql://root:***@localhost/csv_data
2 rows affected.

# Example 2 With small data

In [170]:
# create database

%sql CREATE DATABASE tempdata

 * mysql+pymysql://root:***@localhost/csv_data
1 rows affected.

[]

In [177]:
# create table
%sql USE tempdata 
%sql CREATE TABLE users( username VARCHAR(255) NOT NULL, name VARCHAR(255) NOT NULL, password INTEGER )

 * mysql+pymysql://root:***@localhost/csv_data
0 rows affected.
 * mysql+pymysql://root:***@localhost/csv_data
0 rows affected.

[]

In [181]:
# now fill value

%sql INSERT INTO tempdata.users VALUES ('mubeenxyz@123','Mubeen',123),('ali@123','Ali',123), ('Riz','Rizwan',0)

 * mysql+pymysql://root:***@localhost/csv_data
2 rows affected.

[]

In [183]:
# now check value

%sql SELECT * FROM tempdata.users

 * mysql+pymysql://root:***@localhost/csv_data
3 rows affected.

[('mubeenxyz@123', 'Mubeen', 123),
 ('ali@123', 'Ali', 123),
 ('Riz', 'Rizwan', 0)]

In [188]:
# now update value

%sql UPDATE tempdata.users SET name = "NAME", username = "USERNAME" WHERE password = 123

 * mysql+pymysql://root:***@localhost/csv_data
2 rows affected.

[]

# now check changes

In [195]:
%sql SELECT * FROM tempdata.users

 * mysql+pymysql://root:***@localhost/csv_data
3 rows affected.

[('USERNAME', 'NAME', 123), ('USERNAME', 'NAME', 123), ('Riz', 'Rizwan', 0)]

<br>

# DELETE

In [197]:
%sql INSERT INTO tempdata.users VALUES ('Mubeen@xyz','Mubeen',1), ('xyz','XYZ',2)

 * mysql+pymysql://root:***@localhost/csv_data
2 rows affected.

[]

In [198]:
# check value
%sql SELECT * FROM tempdata.users

 * mysql+pymysql://root:***@localhost/csv_data
5 rows affected.

[('USERNAME', 'NAME', 123),
 ('USERNAME', 'NAME', 123),
 ('Riz', 'Rizwan', 0),
 ('Mubeen@xyz', 'Mubeen', 1),
 ('xyz', 'XYZ', 2)]

In [200]:
# now delete row with password = 0

%sql DELETE FROM tempdata.users WHERE password = 0

 * mysql+pymysql://root:***@localhost/csv_data
1 rows affected.

[]

In [201]:
# check value
%sql SELECT * FROM tempdata.users

 * mysql+pymysql://root:***@localhost/csv_data
4 rows affected.

[('USERNAME', 'NAME', 123),
 ('USERNAME', 'NAME', 123),
 ('Mubeen@xyz', 'Mubeen', 1),
 ('xyz', 'XYZ', 2)]

## Delete value on multiple condition

In [203]:
%sql DELETE FROM tempdata.users WHERE username = "USERNAME" OR password = 2

 * mysql+pymysql://root:***@localhost/csv_data
3 rows affected.

[]

In [204]:
# check value
%sql SELECT * FROM tempdata.users

 * mysql+pymysql://root:***@localhost/csv_data
1 rows affected.

[('Mubeen@xyz', 'Mubeen', 1)]